YaroslavTrymbach/ChargeStation/Stm32/ChargeStationCentralCPU/Src/main.c
void mainDispatcher(void){
	uint32_t currentTick, lastLedTick;
	uint32_t lastSendTick, lastMeterReqTick;
	char sendData[16];
	GeneralMessage message;
	uint32_t btnPressCnt = 0;
	
	ChargePoint_init();
	
	Settings_init();
	settings = Settings_get();
	printf("ChargePointID: %s\n", settings->ChargePointId);
	
	localAuthList_load();
	
	fillOcppConfigurationWithDefValues(&ocppConfVaried, &ocppConfFixed, &ocppConfRestrict);
	
	
	
	initDisplay();
	initConnectors();
	checkHardware();
	
	Display_clear();
	Indication_Init(connector);
	
	if(ChargePoint_getStatusState() != CHARGE_POINT_STATUS_FAULTED){
		ChargePoint_setStatusState(CHARGE_POINT_STATUS_AVAILABLE, 0, NULL);
	}
	
	Channel_start(TASK_TAG_CHANNELS, mainQueue, connector, CONFIGURATION_NUMBER_OF_CONNECTORS);
	
	RFID_start(TASK_TAG_RFID, mainQueue);
	SerialControl_start(TASK_TAG_SERIAL_CONTROL, mainQueue);
	NET_start(TASK_TAG_NET, mainQueue);
	
	Display_PrintStrCenter(0, "Waiting\0");
	
	lastLedTick = HAL_GetTick(); 
	lastSendTick = lastLedTick;
	lastMeterReqTick = lastLedTick;
	
	// Infinite loop 
  for(;;)
  {
		
		while(xQueueReceive(mainQueue, &message, 0) == pdPASS){
			switch(message.sourceTag){
				case TASK_TAG_RFID:
					processMessageFromRFID(&message);
					break;
				case TASK_TAG_USER_BUTTON:
					//printf("User button is pressed %d\n", ++btnPressCnt);
				  //testSaveSetting();
				  //printCurrentDateTime();
				  NET_test();
				  //testReconnect();
					break;
				case TASK_TAG_SERIAL_CONTROL:
					processMessageFromSerialControl(&message);
					break;
				case TASK_TAG_NET:
					processMessageFromNET(&message);
					break;
				case TASK_TAG_CHANNELS:
					processMessageFromChannels(&message);
					break;
			}
			
		}
		
		currentTick = HAL_GetTick();
		if((currentTick - lastLedTick) >= 500){
			lastLedTick = currentTick;
			toggleBlueLed();
		}
		
		if((currentTick - lastSendTick) >= 1000){
			lastSendTick = currentTick;
			sprintf(sendData, "%.8X\r", lastSendTick);
			//CDC_Transmit_FS((uint8_t*)sendData, strlen(sendData));
		}
		
		//For channel with charging process need update meter value
		if((currentTick - lastMeterReqTick) >= 1000){
			lastMeterReqTick = currentTick;
			updateMeterValues();
			
		}
		
		Indication_CheckMessage();
		osDelay(1);
	}
}

void onUserButtonPressed(){
	GeneralMessage message;
	uint32_t tick;
	tick = HAL_GetTick();
	if((tick - lastUserButtonPressTick) >= 200){
		lastUserButtonPressTick = tick;
		message.sourceTag = TASK_TAG_USER_BUTTON;
		//This function is called from Interrupt so use ISR version of xQueueSend
		xQueueSendFromISR(mainQueue, &message, NULL);
	}
	
}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin){
	switch(GPIO_Pin){
		case USER_Btn_Pin:
			onUserButtonPressed();
			break;
	}
}

/* USER CODE END 4 */

/* StartDefaultTask function */
void StartDefaultTask(void const * argument)
{
  /* init code for USB_DEVICE */
  MX_USB_DEVICE_Init();

  /* init code for LWIP */
  //MX_LWIP_Init();

  /* USER CODE BEGIN 5 */
	mainDispatcher();
	
	
  /* Infinite loop */
	/// !!! Сюда мы не должны доходить
  for(;;)
  {
		//RFID_check_connection();
		//HAL_Delay(100);
		/*if(MFRC522_Check(str) == MI_OK){
			printf("Found card 0x%.2X%.2X%.2X%.2X\n", str[0], str[1], str[2], str[3]);
			HAL_Delay(100);
		}*/
		
    osDelay(1);
  }
  /* USER CODE END 5 */ 
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
